app/controllers/friends_controller.rb

  def create
    #@friend = Friend.new(friend_params)
    @friend = current_user.friends.build(friend_params)
    respond_to do |format|
      if @friend.save
---
INSERT INTO "friends" ("first_name", "last_name", "email", "phone", "discord", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @friend.update(friend_params)
---
UPDATE "friends" SET "first_name" = ?, "user_id" = ?, "updated_at" = ? WHERE "friends"."id" = ?  [["first_name", "zsz"], ["user_id", 7], ["updated_at", "2020-12-06 10:28:56.361073"], ["id", 22]]

  def destroy
    @friend.destroy
---
DELETE FROM "friends" WHERE "friends"."id" = ?  [["id", 23]]

  def correct_user
    @friend = current_user.friends.find_by(id: params[:id])
---
SELECT "friends".* FROM "friends" WHERE "friends"."user_id" = ? AND "friends"."id" = ? LIMIT ?  [["user_id", 6], ["id", 23], ["LIMIT", 1]]